{
  "products": [
    {
      "id": 1,
      "name": "iPhone 14 Pro",
      "desc": "Apple iPhone 12th generation",
      "price": 999,
      "color": "#33505a",
      "image": "https://d2d22nphq0yz8t.cloudfront.net/88e6cc4b-eaa1-4053-af65-563d88ba8b26/https://media.croma.com/image/upload/v1662703541/Croma%20Assets/Communication/Mobiles/Images/261930_q0hq3w.png/mxw_2048,f_auto"
      "description": "The ultra-wide camera features a new larger 12-megapixel sensor that has 100% focus pixels. The lens has also been improved for optical clarity and features a larger aperture. The new camera system also incorporates a new Photonic Engine for improved image and video quality."
    },
    {
      "id": 2,
      "name": "Pixel 7 Pro",
      "desc": "Google Pixel phone 7th generation",
      "price": 699,
      "color": "#00ac51",
      "image": "https://lh3.googleusercontent.com/4-PKSeiFvcCOBxaMrgh-l8NfYAEDVjnOqfO7auGH1t8OXDBBWSRQtV6zGBW3huHBmxQmI_xZID-iKG_RJ56LABv6WiCV2lOhrck=rw-e365-w525"
      "description": "Google Pixel 7 Pro gives you an immersive and crystal-clear viewing experience as it features a 6.7 inches LTPO AMOLED display. The screen resolution is 1440 x 3120 pixels, 19.5:9 aspect ratio, and 120Hz refresh rate. Apart from this, the mobile is powered with Google's own Tensor G2 chipset, a 4nm chipset with 2 Cortex-X1 cores, two Cortex-A76 cores and four Cortex-A55 cores that gives a faster and glitch-free performance while playing games that have intense graphics, browsing the web, and accessing multiple applications at the same time. " 
    },
    {
      "id": 3,
      "name": "M1 Macbook Air",
      "desc": "Apple Macbook air with apple silicon",
      "price": 1099,
      "color": "#e0bfae",
      "image": "https://support.apple.com/library/APPLE/APPLECARE_ALLGEOS/SP825/macbookair.png"
      "description": "The M1 MacBook Air is a lightweight and powerful laptop from Apple that features the latest Apple-designed M1 chip, offering lightning-fast performance and longer battery life. With a stunning Retina display, Magic Keyboard, and Touch ID, the MacBook Air is perfect for everyday use, work, or entertainment. It also runs on the latest macOS Big Sur, which offers a seamless experience with advanced security features and a variety of built-in apps."
    },
    {
      "id": 4,
      "name": "Playstation 5",
      "desc": "Sony Playstation 5th generation",
      "price": 500,
      "color": "#544ee4",
      "image": "https://d2d22nphq0yz8t.cloudfront.net/88e6cc4b-eaa1-4053-af65-563d88ba8b26/https://media.croma.com/image/upload/v1668409290/Croma%20Assets/Gaming/Gaming%20Consoles/Images/265329_spoecy.png/mxw_640,f_auto"
      "description": "The PlayStation 5 (PS5) is the latest gaming console from Sony, featuring advanced hardware and technology for immersive gaming experiences. It boasts lightning-fast load times, stunning graphics and visual effects, and a customized SSD for speedy game installations and streaming. The PS5 also includes a DualSense wireless controller with haptic feedback and adaptive triggers, allowing for a more immersive gaming experience. Additionally, it offers backwards compatibility for many PlayStation 4 games, as well as a growing library of new games designed specifically for the PS5." 
    },
    {
      "id": 5,
      "name": "Airpods Pro",
      "desc": "Apple Aipods Pro 1st generation",
      "price": 200,
      "color": "#e3e4e9",
      "image": "https://crdms.images.consumerreports.org/c_lfill,w_598/prod/products/cr/models/400116-wireless-portable-headphones-apple-airpods-pro-10009323.png"
      "description": "AirPods Pro are Apple's wireless earbuds with active noise cancellation technology. They feature a comfortable in-ear design with customizable silicone tips for a secure and comfortable fit. The AirPods Pro provide excellent sound quality with a powerful bass and clear audio for phone calls and music playback. The active noise cancellation feature allows users to block out external noise for a more immersive experience, while a transparency mode allows them to hear their surroundings when needed. The earbuds also come with a wireless charging case that provides up to 24 hours of battery life."
    },
    {
      "id": 6,
      "name": "iPad Pro",
      "desc": "Apple iPad Pro 2020 edition",
      "price": 799,
      "color": "#f73984",
      "image": "https://store.storeimages.cdn-apple.com/4982/as-images.apple.com/is/ipad-pro-12-select-wifi-silver-202003_FMT_WHH?wid=940&hei=1112&fmt=png-alpha&qlt=80&.v=1583551131102"
      "description": "The iPad Pro is Apple's high-end tablet that offers powerful performance and advanced features. It comes in two sizes: 11 inches and 12.9 inches, and features a Liquid Retina display with ProMotion technology that offers smooth scrolling and high refresh rates. The iPad Pro is powered by the Apple M1 chip, which delivers blazing-fast performance and allows for multitasking with ease. It also includes a variety of input options, including Apple Pencil support and a Magic Keyboard with trackpad. The iPad Pro runs on the latest iPadOS, which offers advanced productivity features and a variety of apps optimized for the larger screen. It also features Face ID for secure and easy authentication."
    },
    {
      "id": 7,
      "name": "Galaxy S21 Ultra",
      "desc": "Samsung Galaxy S21 Ultra 2021 edition",
      "price": 1299,
      "color": "#1c1c1c",
      "image": "https://lh3.googleusercontent.com/qRQPjHrhRVIs-xnfNSyiPXOH2vH97ylMacgbTKebqJtRfNH3LlYo8pN-5igsLDWUH62tGl5zNpTsl5xd8SprzGmXoCEmWFOi2-2cQVGS-r3PaRXHt62DmJHq-jrYX0UQvWZ9BA=s800-c"
      "description": "The Galaxy S21 Ultra is a high-end smartphone from Samsung, featuring a large 6.8-inch Dynamic AMOLED 2X display with a resolution of 3200x1440 pixels. It is powered by the Exynos 2100 or Qualcomm Snapdragon 888 processor (depending on region) and comes with 12GB or 16GB of RAM, depending on the configuration. The S21 Ultra has a quad-camera setup on the back, including a 108-megapixel main camera, a 12-megapixel ultra-wide camera, a 10-megapixel periscope telephoto camera, and a 10-megapixel telephoto camera. It also has a 40-megapixel front-facing camera for selfies and video calls." 
    },
    {
      "id": 8,
      "name": "Galaxy S21",
      "desc": "Samsung Galaxy S21 2021 edition",
      "price": 899,
      "color": "#7c95eb",
      "image": "https://images.samsung.com/is/image/samsung/p6pim/za/galaxy-s21/gallery/za-clear-cover-galaxy-s21-5g-ef-qg991ttegww-363168624?$720_576_PNG$"
      "description": "The Galaxy S21 is a high-end smartphone from Samsung, featuring a 6.2-inch Dynamic AMOLED 2X display with a resolution of 2400x1080 pixels. It is powered by the Exynos 2100 or Qualcomm Snapdragon 888 processor (depending on region) and comes with 8GB of RAM and 128GB or 256GB of internal storage, depending on the configuration. The S21 has a triple-camera setup on the back, including a 12-megapixel main camera, a 12-megapixel ultra-wide camera, and a 64-megapixel telephoto camera."
    }
  ]
}
